[
  {
    "company_name": "Apple Inc.",
    "title": "US spy chief says UK has dropped its Apple backdoor demand",
    "url": "https://finance.yahoo.com/news/us-spy-chief-says-uk-142533384.html",
    "source": "Yahoo! Finance",
    "dateTime": "2025-08-19T15:39:06Z",
    "image": "https://s.yimg.com/ny/api/res/1.2/8odAg6CiVF6lb6LURYqvGg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/techcrunch_finance_785/5d88e2fc2f20ad75e3730c02316273ea",
    "body": "The U.K has dropped its demand for special access to Apple's cloud systems, or a \"backdoor,\" following negotiations with the Trump administration, according to U.S. National Intelligence Director Tulsi Gabbard.\n\n\"As a result, the U.K. has agreed to drop its mandate for Apple to provide a 'back door' that would have enabled access to the protected encrypted data of American citizens and encroached on our civil liberties,\" Gabbard wrote in a post on X. She also claimed that she worked along President Donald Trump and Vice President JD Vance in the negotiations.\n\nThis is the latest (and unexpected) development in a months-long saga that saw the British government secretly demanding Apple to grant its authorities access -- essentially asking for a backdoor -- to the encrypted data of iCloud users, effectively anywhere in the world, particularly those who turn on Advanced Data Protection (or ADP), an opt-in security feature. ADP turns on end-to-end encryption for iCloud, meaning only the user can access their files stored on Apple's cloud servers.\n\nThe existence of the legal demand was first reported by The Washington Post in February, which was made under the U.K.'s Investigatory Powers Act 2016, also known as the Snoopers' Charter. The request sparked outrage and condemnation from privacy and security experts worldwide, who argued that if the U.K. government obtained what it wanted, it would weaken privacy for the whole world, and also open the door for more governments to make similar demands, even in other companies' technologies.\n\nApple initially responded by removing ADP from the U.K., meaning new users couldn't turn it on. The company also said it would give guidance to existing users who \"will eventually need to disable this security feature.\"\n\nIn the meantime, Apple also reportedly challenged the backdoor mandate in court, a case that was initially secret but was then ruled to be held in public.\n\nApple and the U.K. Home Office, which initiated the demand on behalf of the British government, did not respond to requests for comment."
  },
  {
    "company_name": "Apple Inc.",
    "title": "An Apple robot will need a lot of AI help",
    "url": "https://finance.yahoo.com/news/an-apple-robot-will-need-a-lot-of-ai-help-135116585.html",
    "source": "Yahoo! Finance",
    "dateTime": "2025-08-19T13:56:01Z",
    "image": "https://s.yimg.com/ny/api/res/1.2/mTIWWFY1fs5KxDj3OYBPiA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://s.yimg.com/os/creatr-uploaded-images/2025-01/4aae2830-dda3-11ef-9f5f-9631a8d45eb7",
    "body": "Apple (AAPL) is reportedly planning a push into robotics as it continues its search for its next hit product. That includes developing a robotic arm outfitted with an iPad-like display and exploring wheeled and humanoid robots down the line, according to Bloomberg's Mark Gurman.\n\nThe move could also bolster Apple's smart home efforts, which to this point have centered around its HomePod and HomePod mini.\n\nAnd while Apple has made some headway in robotics via prototypes and research, its prospects in the space could all come down to ensuring it has the AI chops to build a home robot that can understand and respond to requests.\n\n\"It all falls back to how that voice-based interface works and how accurate it is, and that's the part that Apple has been arguably falling behind on,\" TECHnalysis founder and chief analyst Bob O'Donnell explained.\n\nApple did not respond to a request for comment regarding the Bloomberg report.\n\nApple has faced continuous criticism for delaying its AI-powered version of Siri from this year to sometime in 2026, leaving questions about the company's AI capabilities.\n\nAccording to Gurman, Apple is working on two new versions of Siri: one that runs on its own in-house AI model and another powered by third-party models. The company will eventually decide which of the two makes it into its products. But there's still no sense of when it will be ready for primetime.\n\nStill, if Apple is working on consumer robotics and can get the products to market, it has a good shot at winning over customers.\n\n\"What I like about it is this is Apple doing what Apple does,\" explained Bill Ray, distinguished vice president analyst and chief of research at Gartner. \"It takes existing technologies, often other people's technologies, and makes them elegant.\"\n\nPart of Apple's robotics push will reportedly include a robotic arm with a display that Bloomberg said is similar to a research project Apple revealed in January. The project, called ELEGNT: Expressive and Functional Movement Design for Non-Anthropomorphic Robot, features a lamp-like design with a projector at the top that can act as a light or project video content onto a nearby surface.\n\nBut the key to the arm is how it responds to user interaction. Rather than sharp, direct movements, the arm moves as if it's exhibiting emotion. For instance, it can lower its projector as if it's dropping its head to appear sad, and it can gently push a glass of water toward you to remind you to stay hydrated."
  },
  {
    "company_name": "Apple Inc.",
    "title": "Apple just landed a key win for the global encryption fight",
    "url": "https://www.cnbc.com/2025/08/19/apple-just-landed-a-key-win-for-the-global-encryption-fight.html",
    "source": "CNBC",
    "dateTime": "2025-08-19T11:37:54Z",
    "image": "https://image.cnbcfm.com/api/v1/image/108075163-1734019116925-gettyimages-2189598231-173a0009_s1efmyic.jpeg?v=1755596454&w=1920&h=1080",
    "body": "Chief Executive of Apple, Tim Cook gives a thumb's up during a tour the Apple Headquarters on December 12, 2024 in London, England.\n\nApple clinched a major win Monday after the U.S. government announced that the U.K. had agreed to drop its demand for the company to provide a \"back door\" granting officials access to users' encrypted data.\n\nThe iPhone maker won't be alone to rejoice in the outcome.\n\nThe development came after extensive talks between Britain and the U.S., which had raised national security concerns over the request.\n\nAt the root of the row was end-to-end encryption, a technology which secures communications between two devices in a way that means not even the company providing a chat service can view any messages."
  },
  {
    "company_name": "Apple Inc.",
    "title": "Apple Expands iPhone Production in India for US-Bound New Models",
    "url": "https://www.bloomberg.com/news/articles/2025-08-19/apple-expands-iphone-production-in-india-for-us-bound-new-models",
    "source": "Bloomberg Business",
    "dateTime": "2025-08-19T06:28:31Z",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i7.cpGAedw8A/v1/1200x800.jpg",
    "body": "Apple Inc. is expanding iPhone production in India at five factories, including a pair of recently opened plants, as it seeks to lessen its reliance on China for US-bound models.\n\nThe company is producing all four iPhone 17 models in India ahead of their debut next month, marking the first time that all new variations -- including pro-level versions -- will ship from the South Asian country from the get-go, according to people with knowledge of the matter."
  },
  {
    "company_name": "Apple Inc.",
    "title": "Britain caves in to Trump demands on Apple security 'backdoor'",
    "url": "https://finance.yahoo.com/news/britain-caves-trump-demands-apple-070101726.html?guccounter=1&guce_referrer=aHR0cHM6Ly9zcG9ydHMueWFob28uY29tL2ZlZWQvcnNzLw&guce_referrer_sig=AQAAAKjsWa46oIkVRfmDxzZ2zbgb33dQA5AGaYPaj84N4UuY-2YaE4qtmiTQnQkPipc0-WEw1M2MfNockq7YK6ikAqiCcFEnLF2qABJ5A1ju0G0EtoCqTBEJ2Kd1luP199838SPUqc1_dPankaedppkWUNEBGtgvKi_F4EQnt0XjLINc",
    "source": "Yahoo! Finance",
    "dateTime": "2025-08-19T07:15:23Z",
    "image": "https://s.yimg.com/ny/api/res/1.2/Cf7WxH68flDHrIBKX7AM1A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NTI7Y2Y9d2VicA--/https://media.zenfs.com/en/the_telegraph_818/32f115a9fdd66a694fd86fbc0c6264d9",
    "body": "Yvette Cooper has dropped a controversial demand for a \"backdoor\" into people's iPhones under pressure from the White House.\n\nTulsi Gabbard, Donald Trump's director of national intelligence, said the UK had agreed to withdraw an order to Apple that it made earlier this year.\n\nIt comes after President Trump and his vice-president, JD Vance, demanded that the Government drop its plans.\n\nThe order required Apple to break the end-to-end encryption it uses to secure iPhone backups that include a person's photos and messages, potentially allowing security services access to the content of suspects' iPhones.\n\nPrivacy campaigners had said the creation of a backdoor would have jeopardised millions of people's security.\n\n\"Over the past few months, I've been working closely with our partners in the UK, alongside @POTUS and @VP, to ensure Americans' private data remains private and our Constitutional rights and civil liberties are protected,\" Ms Gabbard said on X.\n\n\"As a result, the UK has agreed to drop its mandate for Apple to provide a 'back door' that would have enabled access to the protected encrypted data of American citizens and encroached on our civil liberties.\"\n\nThe Home Office and Apple were contacted for comment.\n\nThe Government order was the first known demand to break encryption under surveillance laws that have been dubbed a \"Snooper's Charter\".\n\nMinisters have never confirmed the existence of a so-called technical capability notice, but government lawyers appeared in a secret court hearing in March after Apple challenged the order.\n\nMr Trump had criticised the Government over the matter, saying it was like \"something that you hear about with China\".\n\nApple removed the \"advanced data protection\" system for British users in February but was still subject to the Home Office order, which applies worldwide, and had appealed to the Investigatory Powers Tribunal.\n\nIn a blow to the Government, the panel ruled that the case would not have blanket secrecy after a legal challenge from media organisations including The Telegraph."
  },
  {
    "company_name": "Apple Inc.",
    "title": "U.S. spy chief Gabbard says UK agreed to drop 'back door' mandate for Apple",
    "url": "https://www.cnbc.com/2025/08/19/us-spy-chief-gabbard-says-uk-agreed-to-drop-back-door-mandate-for-apple.html",
    "source": "CNBC",
    "dateTime": "2025-08-19T05:05:45Z",
    "image": "https://image.cnbcfm.com/api/v1/image/108172270-1752602043024-gettyimages-2224585058-AFP_66UR9EA.jpeg?v=1755577326&w=1920&h=1080",
    "body": "U.S. Director of National Intelligence Tulsi Gabbard said on Monday the UK had agreed to drop its mandate for iPhone maker Apple to provide a \"back door\".\n\nU.S. Director of National Intelligence Tulsi Gabbard said on Monday the U.K. had agreed to drop its mandate for iPhone maker Apple to provide a \"back door\" that would have enabled access to the protected encrypted data of American citizens.\n\nGabbard issued the statement on X, saying she had worked for months with Britain, along with President Donald Trump and Vice President JD Vance to arrive at a deal.\n\nBritish Prime Minister Keir Starmer was in Washington on Monday along with other European leaders to meet Trump and discuss Russia's war in Ukraine.\n\nThe U.K. government and Apple did not immediately respond to requests for comment on Gabbard's statement.\n\nU.S. lawmakers said in May that the U.K.'s order to Apple to create a backdoor to its encrypted user data could be exploited by cybercriminals and authoritarian governments.\n\nApple, which has said it would never build a so-called back door into its encrypted services or devices, had challenged the order at the U.K.'s Investigatory Powers Tribunal (IPT).\n\nThe iPhone maker withdrew its Advanced Data Protection feature for U.K. users in February following the U.K. order. Users of Apple's iPhones, Macs and other devices can enable the feature to ensure that only they -- and not even Apple -- can unlock data stored on its cloud.\n\nU.S. officials said earlier this year they were examining whether the U.K. broke a bilateral agreement by demanding that Apple build a backdoor allowing the British government to access backups of data in the company's encrypted cloud storage systems.\n\nIn a letter dated February 25 to U.S. lawmakers, Gabbard said the U.S. was examining whether the U.K. government had violated the CLOUD Act, which bars it from issuing demands for the data of U.S. citizens and vice versa.\n\nCybersecurity experts told Reuters that if Apple chose to build a backdoor for a government, that backdoor would eventually be found and exploited by hackers.\n\nApple has sparred with regulators over encryption as far back as 2016 when the U.S. government tried to compel it to build a tool to unlock the iPhone of a suspected extremist."
  },
  {
    "company_name": "Apple Inc.",
    "title": "UK Drops Mandate for Apple 'Backdoor' on Americans, Gabbard Says",
    "url": "https://www.bloomberg.com/news/articles/2025-08-19/uk-drops-mandate-for-apple-backdoor-on-americans-gabbard-says",
    "source": "Bloomberg Business",
    "dateTime": "2025-08-19T03:13:56Z",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ifK8DPlpcOgg/v0/1200x800.jpg",
    "body": "Apple Inc. will no longer be forced to provide a so-called backdoor to American users' data to the UK government, US Director of National Intelligence Tulsi Gabbard said in a post on X on Monday.\n\nThe iPhone maker had been compelled by a UK order in January to disable its most advanced encryption for user information stored in its cloud services, as authorities sought access to global user data, which may include communications like device backups and voice memos."
  },
  {
    "company_name": "Apple Inc.",
    "title": "US spy chief Gabbard says UK agreed to drop 'backdoor' mandate for Apple",
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/us-spy-chief-gabbard-says-uk-agreed-drop-backdoor-mandate-apple-2025-08-19/",
    "source": "Reuters",
    "dateTime": "2025-08-19T03:01:57Z",
    "image": "https://www.reuters.com/resizer/v2/IQMU6A366JOQBIWL4X5YP24MLI.jpg?auth=b559009d52d100ec3da2ee979a3ed7b88e1d83624f99e5d0ff62ae008c2c762f&height=1005&width=1920&quality=80&smart=true",
    "body": "WASHINGTON, Aug 18 (Reuters) - U.S. Director of National Intelligence Tulsi Gabbard said on Monday the UK had agreed to drop its mandate for iPhone maker Apple (AAPL.O), opens new tab to provide a \"backdoor\" that would have enabled access to the protected encrypted data of American citizens.\n\nGabbard issued the statement on X, opens new tab, saying she had worked for months with Britain, along with President Donald Trump and Vice President JD Vance to arrive at a deal.\n\nBritish Prime Minister Keir Starmer was in Washington on Monday along with other European leaders to meet Trump and discuss Russia's war in Ukraine.\n\nThe UK government and Apple did not immediately respond to requests for comment on Gabbard's statement.\n\nU.S. lawmakers said in May that the UK's order to Apple to create a backdoor to its encrypted user data could be exploited by cybercriminals and authoritarian governments.\n\nApple, which has said it would never build such access into its encrypted services or devices, had challenged the order at the UK's Investigatory Powers Tribunal (IPT).\n\nThe iPhone maker withdrew its Advanced Data Protection feature for UK users in February following the UK order. Users of Apple's iPhones, Macs and other devices can enable the feature to ensure that only they -- and not even Apple -- can unlock data stored on its cloud.\n\nU.S. officials said earlier this year they were examining whether the UK broke a bilateral agreement by demanding that Apple build a backdoor allowing the British government to access backups of data in the company's encrypted cloud storage systems.\n\nIn a letter dated February 25 to U.S. lawmakers, Gabbard said the U.S. was examining whether the UK government had violated the CLOUD Act, which bars it from issuing demands for the data of U.S. citizens and vice versa.\n\nCybersecurity experts told Reuters that if Apple chose to build a backdoor for a government, that backdoor would eventually be found and exploited by hackers.\n\nApple has sparred with regulators over encryption as far back as 2016 when the U.S. government tried to compel it to build a tool to unlock the iPhone of a suspected extremist.\n\nReporting by Kanishka Singh in Washington; Editing by Kate Mayberry\n\nOur Standards: The Thomson Reuters Trust Principles., opens new tab\n\n* Suggested Topics:\n\n* Boards, Policy & Regulation\n\nKanishka Singh\n\nThomson Reuters\n\nKanishka Singh is a breaking news reporter for Reuters in Washington DC, who primarily covers US politics and national affairs in his current role. His past breaking news coverage has spanned across a range of topics like the Black Lives Matter movement; the US elections; the 2021 Capitol riots and their follow up probes; the Brexit deal; US-China trade tensions; the NATO withdrawal from Afghanistan; the COVID-19 pandemic; and a 2019 Supreme Court verdict on a religious dispute site in his native India."
  }
]